import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Jon', 'Piter', 'Viktor', 'Alex', 'Olga'],
    'Математика': [5, 5, 4, 4, 4, 3, 5, 5, 4, 5],
    'Физика': [4, 4, 5, 5, 4, 5, 4, 3, 4, 4],
    'Химия': [3, 5, 5, 4, 4, 4, 4, 5, 4, 4],
    'Литература': [5, 5, 4, 5, 4, 4, 4, 5, 5, 4],
    'Русский язык': [4, 5, 4, 4, 4, 4, 4, 4, 5, 5],
}

df = pd.DataFrame(data)

print(df)

print(f"Средняя оценка по Математике - {df["Математика"].mean()}")
print(f"Средняя оценка по Физике - {df["Физика"].mean()}")
print(f"Средняя оценка по Химии - {df["Химия"].mean()}")
print(f"Средняя оценка по Литературе - {df["Литература"].mean()}")
print(f"Средняя оценка по Русскому языку - {df["Русский язык"].mean()}")

print(f"Медианная оценка по Математике - {df["Математика"].median()}")
print(f"Медианная оценка по Физике - {df["Физика"].median()}")
print(f"Медианная оценка по Химии - {df["Химия"].median()}")
print(f"Медианная оценка по Литературе - {df["Литература"].median()}")
print(f"Медианная оценка по Русскому языку - {df["Русский язык"].median()}")

print(f"Стандартное отклонение по Математике - {df["Математика"].std()}")

Q1 = df["Математика"].quantile(0.25)
Q3 = df["Математика"].quantile(0.75)
IQR = Q3 - Q1
df.boxplot(column="Математика")
plt.show()
